TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
typedef struct {
       uint32_t RESERVED0[512];
  __IO uint32_t PWREN;                             /* !< (@ 0x00006800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00006804) Reset Control */
       uint32_t RESERVED1[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00006814) Status Register */
       uint32_t RESERVED2[506];
  CANFD1_MCAN_Regs  MCAN;                              /* !< (@ 0x00007000) */
       uint32_t RESERVED3[65];
  CANFD1_TI_WRAPPER_Regs  TI_WRAPPER;                        /* !< (@ 0x00007200) */
} CANFD1_MCANSS_Regs;

/*@}*/ /* end of group CANFD1_MCANSS */

/** @addtogroup CANFD1
  @{
*/

typedef struct {
       uint32_t RESERVED0[6144];
  CANFD1_MCANSS_Regs  MCANSS;                            /* !< (@ 0x00006000) */
} CANFD1_Regs;

/*@}*/ /* end of group CANFD1 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* CANFD1 Register Control Bits
******************************************************************************/

/* CANFD1_IIDX Bits */
/* CANFD1_IIDX[STAT] Bits */
#define CANFD1_IIDX_STAT_OFS                     (0)                             /* !< STAT Offset */
#define CANFD1_IIDX_STAT_MASK                    ((uint32_t)0x000000FFU)         /* !< Interrupt index status */
#define CANFD1_IIDX_STAT_NO_INTR                 ((uint32_t)0x00000000U)         /* !< No interrupt pending. */
#define CANFD1_IIDX_STAT_INTL0                   ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 interrupt
                                                                                    pending. */
#define CANFD1_IIDX_STAT_INTL1                   ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 interrupt
                                                                                    pending. */
#define CANFD1_IIDX_STAT_SEC                     ((uint32_t)0x00000003U)         /* !< Message RAM SEC (Single Error
                                                                                    Correction) interrupt pending. */
#define CANFD1_IIDX_STAT_DED                     ((uint32_t)0x00000004U)         /* !< Message RAM DED (Double Error
                                                                                    Detection)  interrupt pending. */
#define CANFD1_IIDX_STAT_EXT_TS_CNTR_OVFL        ((uint32_t)0x00000005U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt pending. */
#define CANFD1_IIDX_STAT_WAKEUP                  ((uint32_t)0x00000006U)         /* !< Clock Stop Wake Up interrupt
                                                                                    pending. */

/* CANFD1_IMASK Bits */
/* CANFD1_IMASK[INTL0] Bits */
#define CANFD1_IMASK_INTL0_OFS                   (0)                             /* !< INTL0 Offset */
#define CANFD1_IMASK_INTL0_MASK                  ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0 mask. */
#define CANFD1_IMASK_INTL0_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_INTL0_SET                   ((uint32_t)0x00000001U)         /* !< Set Interrrupt Mask */
/* CANFD1_IMASK[INTL1] Bits */
#define CANFD1_IMASK_INTL1_OFS                   (1)                             /* !< INTL1 Offset */
#define CANFD1_IMASK_INTL1_MASK                  ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1 mask. */
#define CANFD1_IMASK_INTL1_CLR                   ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_INTL1_SET                   ((uint32_t)0x00000002U)         /* !< Set Interrrupt Mask */
/* CANFD1_IMASK[SEC] Bits */
#define CANFD1_IMASK_SEC_OFS                     (2)                             /* !< SEC Offset */
#define CANFD1_IMASK_SEC_MASK                    ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt mask. */
#define CANFD1_IMASK_SEC_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_SEC_SET                     ((uint32_t)0x00000004U)         /* !< Set Interrrupt Mask */
/* CANFD1_IMASK[DED] Bits */
#define CANFD1_IMASK_DED_OFS                     (3)                             /* !< DED Offset */
#define CANFD1_IMASK_DED_MASK                    ((uint32_t)0x00000008U)         /* !< Massage RAM DED interrupt mask. */
#define CANFD1_IMASK_DED_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_DED_SET                     ((uint32_t)0x00000008U)         /* !< Set Interrrupt Mask */
/* CANFD1_IMASK[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_IMASK_EXT_TS_CNTR_OVFL_OFS        (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_IMASK_EXT_TS_CNTR_OVFL_MASK       ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt mask. */
#define CANFD1_IMASK_EXT_TS_CNTR_OVFL_CLR        ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_EXT_TS_CNTR_OVFL_SET        ((uint32_t)0x00000010U)         /* !< Set Interrrupt Mask */
/* CANFD1_IMASK[WAKEUP] Bits */
#define CANFD1_IMASK_WAKEUP_OFS                  (5)                             /* !< WAKEUP Offset */
#define CANFD1_IMASK_WAKEUP_MASK                 ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt mask. */
#define CANFD1_IMASK_WAKEUP_CLR                  ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define CANFD1_IMASK_WAKEUP_SET                  ((uint32_t)0x00000020U)         /* !< Set Interrrupt Mask */

/* CANFD1_RIS Bits */
/* CANFD1_RIS[INTL0] Bits */
#define CANFD1_RIS_INTL0_OFS                     (0)                             /* !< INTL0 Offset */
#define CANFD1_RIS_INTL0_MASK                    ((uint32_t)0x00000001U)         /* !< MCAN Interrupt Line 0. */
#define CANFD1_RIS_INTL0_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_INTL0_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* CANFD1_RIS[INTL1] Bits */
#define CANFD1_RIS_INTL1_OFS                     (1)                             /* !< INTL1 Offset */
#define CANFD1_RIS_INTL1_MASK                    ((uint32_t)0x00000002U)         /* !< MCAN Interrupt Line 1. */
#define CANFD1_RIS_INTL1_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_INTL1_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* CANFD1_RIS[SEC] Bits */
#define CANFD1_RIS_SEC_OFS                       (2)                             /* !< SEC Offset */
#define CANFD1_RIS_SEC_MASK                      ((uint32_t)0x00000004U)         /* !< Message RAM SEC interrupt. */
#define CANFD1_RIS_SEC_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_SEC_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* CANFD1_RIS[DED] Bits */
#define CANFD1_RIS_DED_OFS                       (3)                             /* !< DED Offset */
#define CANFD1_RIS_DED_MASK                      ((uint32_t)0x00000008U)         /* !< Message RAM DED interrupt. */
#define CANFD1_RIS_DED_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_DED_SET                       ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* CANFD1_RIS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_RIS_EXT_TS_CNTR_OVFL_OFS          (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_RIS_EXT_TS_CNTR_OVFL_MASK         ((uint32_t)0x00000010U)         /* !< External Timestamp Counter Overflow
                                                                                    interrupt. */
#define CANFD1_RIS_EXT_TS_CNTR_OVFL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_EXT_TS_CNTR_OVFL_SET          ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* CANFD1_RIS[WAKEUP] Bits */
#define CANFD1_RIS_WAKEUP_OFS                    (5)                             /* !< WAKEUP Offset */
#define CANFD1_RIS_WAKEUP_MASK                   ((uint32_t)0x00000020U)         /* !< Clock Stop Wake Up interrupt. */
#define CANFD1_RIS_WAKEUP_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_RIS_WAKEUP_SET                    ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* CANFD1_MIS Bits */
/* CANFD1_MIS[INTL0] Bits */
#define CANFD1_MIS_INTL0_OFS                     (0)                             /* !< INTL0 Offset */
#define CANFD1_MIS_INTL0_MASK                    ((uint32_t)0x00000001U)         /* !< Masked MCAN Interrupt Line 0. */
#define CANFD1_MIS_INTL0_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_INTL0_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* CANFD1_MIS[INTL1] Bits */
#define CANFD1_MIS_INTL1_OFS                     (1)                             /* !< INTL1 Offset */
#define CANFD1_MIS_INTL1_MASK                    ((uint32_t)0x00000002U)         /* !< Masked MCAN Interrupt Line 1. */
#define CANFD1_MIS_INTL1_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_INTL1_SET                     ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* CANFD1_MIS[SEC] Bits */
#define CANFD1_MIS_SEC_OFS                       (2)                             /* !< SEC Offset */
#define CANFD1_MIS_SEC_MASK                      ((uint32_t)0x00000004U)         /* !< Masked Message RAM SEC interrupt. */
#define CANFD1_MIS_SEC_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_SEC_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* CANFD1_MIS[DED] Bits */
#define CANFD1_MIS_DED_OFS                       (3)                             /* !< DED Offset */
#define CANFD1_MIS_DED_MASK                      ((uint32_t)0x00000008U)         /* !< Masked Message RAM DED interrupt. */
#define CANFD1_MIS_DED_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_DED_SET                       ((uint32_t)0x00000008U)         /* !< Interrupt occured */
/* CANFD1_MIS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MIS_EXT_TS_CNTR_OVFL_OFS          (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MIS_EXT_TS_CNTR_OVFL_MASK         ((uint32_t)0x00000010U)         /* !< Masked External Timestamp Counter
                                                                                    Overflow interrupt. */
#define CANFD1_MIS_EXT_TS_CNTR_OVFL_CLR          ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_EXT_TS_CNTR_OVFL_SET          ((uint32_t)0x00000010U)         /* !< Interrupt occured */
/* CANFD1_MIS[WAKEUP] Bits */
#define CANFD1_MIS_WAKEUP_OFS                    (5)                             /* !< WAKEUP Offset */
#define CANFD1_MIS_WAKEUP_MASK                   ((uint32_t)0x00000020U)         /* !< Masked Clock Stop Wake Up
                                                                                    interrupt. */
#define CANFD1_MIS_WAKEUP_CLR                    ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define CANFD1_MIS_WAKEUP_SET                    ((uint32_t)0x00000020U)         /* !< Interrupt occured */

/* CANFD1_ISET Bits */
/* CANFD1_ISET[INTL0] Bits */
#define CANFD1_ISET_INTL0_OFS                    (0)                             /* !< INTL0 Offset */
#define CANFD1_ISET_INTL0_MASK                   ((uint32_t)0x00000001U)         /* !< Set MCAN Interrupt Line 0. */
#define CANFD1_ISET_INTL0_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_INTL0_SET                    ((uint32_t)0x00000001U)         /* !< Set Interrupt */
/* CANFD1_ISET[INTL1] Bits */
#define CANFD1_ISET_INTL1_OFS                    (1)                             /* !< INTL1 Offset */
#define CANFD1_ISET_INTL1_MASK                   ((uint32_t)0x00000002U)         /* !< Set MCAN Interrupt Line 1. */
#define CANFD1_ISET_INTL1_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_INTL1_SET                    ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* CANFD1_ISET[SEC] Bits */
#define CANFD1_ISET_SEC_OFS                      (2)                             /* !< SEC Offset */
#define CANFD1_ISET_SEC_MASK                     ((uint32_t)0x00000004U)         /* !< Set Message RAM SEC interrupt. */
#define CANFD1_ISET_SEC_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_SEC_SET                      ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* CANFD1_ISET[DED] Bits */
#define CANFD1_ISET_DED_OFS                      (3)                             /* !< DED Offset */
#define CANFD1_ISET_DED_MASK                     ((uint32_t)0x00000008U)         /* !< Set Message RAM DED interrupt. */
#define CANFD1_ISET_DED_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_DED_SET                      ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* CANFD1_ISET[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_ISET_EXT_TS_CNTR_OVFL_OFS         (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_ISET_EXT_TS_CNTR_OVFL_MASK        ((uint32_t)0x00000010U)         /* !< Set External Timestamp Counter
                                                                                    Overflow interrupt. */
#define CANFD1_ISET_EXT_TS_CNTR_OVFL_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_EXT_TS_CNTR_OVFL_SET         ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* CANFD1_ISET[WAKEUP] Bits */
#define CANFD1_ISET_WAKEUP_OFS                   (5)                             /* !< WAKEUP Offset */
#define CANFD1_ISET_WAKEUP_MASK                  ((uint32_t)0x00000020U)         /* !< Set Clock Stop Wake Up interrupt. */
#define CANFD1_ISET_WAKEUP_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ISET_WAKEUP_SET                   ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* CANFD1_ICLR Bits */
/* CANFD1_ICLR[INTL0] Bits */
#define CANFD1_ICLR_INTL0_OFS                    (0)                             /* !< INTL0 Offset */
#define CANFD1_ICLR_INTL0_MASK                   ((uint32_t)0x00000001U)         /* !< Clear MCAN Interrupt Line 0. */
#define CANFD1_ICLR_INTL0_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_INTL0_CLR                    ((uint32_t)0x00000001U)         /* !< Clear Interrupt */
/* CANFD1_ICLR[INTL1] Bits */
#define CANFD1_ICLR_INTL1_OFS                    (1)                             /* !< INTL1 Offset */
#define CANFD1_ICLR_INTL1_MASK                   ((uint32_t)0x00000002U)         /* !< Clear MCAN Interrupt Line 1. */
#define CANFD1_ICLR_INTL1_NO_EFFECT              ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_INTL1_CLR                    ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* CANFD1_ICLR[SEC] Bits */
#define CANFD1_ICLR_SEC_OFS                      (2)                             /* !< SEC Offset */
#define CANFD1_ICLR_SEC_MASK                     ((uint32_t)0x00000004U)         /* !< Clear Message RAM SEC interrupt. */
#define CANFD1_ICLR_SEC_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_SEC_CLR                      ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* CANFD1_ICLR[DED] Bits */
#define CANFD1_ICLR_DED_OFS                      (3)                             /* !< DED Offset */
#define CANFD1_ICLR_DED_MASK                     ((uint32_t)0x00000008U)         /* !< Clear Message RAM DED interrupt. */
#define CANFD1_ICLR_DED_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_DED_CLR                      ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* CANFD1_ICLR[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_ICLR_EXT_TS_CNTR_OVFL_OFS         (4)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_ICLR_EXT_TS_CNTR_OVFL_MASK        ((uint32_t)0x00000010U)         /* !< Clear External Timestamp Counter
                                                                                    Overflow interrupt. */
#define CANFD1_ICLR_EXT_TS_CNTR_OVFL_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_EXT_TS_CNTR_OVFL_CLR         ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* CANFD1_ICLR[WAKEUP] Bits */
#define CANFD1_ICLR_WAKEUP_OFS                   (5)                             /* !< WAKEUP Offset */
#define CANFD1_ICLR_WAKEUP_MASK                  ((uint32_t)0x00000020U)         /* !< Clear Clock Stop Wake Up interrupt. */
#define CANFD1_ICLR_WAKEUP_NO_EFFECT             ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_ICLR_WAKEUP_CLR                   ((uint32_t)0x00000020U)         /* !< Clear Interrupt */

/* CANFD1_EVT_MODE Bits */
/* CANFD1_EVT_MODE[INT0_CFG] Bits */
#define CANFD1_EVT_MODE_INT0_CFG_OFS             (0)                             /* !< INT0_CFG Offset */
#define CANFD1_EVT_MODE_INT0_CFG_MASK            ((uint32_t)0x00000003U)         /* !< Event line mode select for event
                                                                                    corresponding to [IPSTANDARD.CPU_INT] */
#define CANFD1_EVT_MODE_INT0_CFG_DISABLE         ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define CANFD1_EVT_MODE_INT0_CFG_SOFTWARE        ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */
#define CANFD1_EVT_MODE_INT0_CFG_HARDWARE        ((uint32_t)0x00000002U)         /* !< The interrupt or event line is in
                                                                                    hardware mode. The hardware (another
                                                                                    module) clears automatically the
                                                                                    associated RIS flag. */

