TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_DESC Bits */
/* CANFD1_DESC[MINREV] Bits */
#define CANFD1_DESC_MINREV_OFS                   (0)                             /* !< MINREV Offset */
#define CANFD1_DESC_MINREV_MASK                  ((uint32_t)0x0000000FU)         /* !< Minor rev of the IP */
#define CANFD1_DESC_MINREV_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define CANFD1_DESC_MINREV_MAXIMUM               ((uint32_t)0x0000000FU)         /* !< Highest possible value */
/* CANFD1_DESC[MAJREV] Bits */
#define CANFD1_DESC_MAJREV_OFS                   (4)                             /* !< MAJREV Offset */
#define CANFD1_DESC_MAJREV_MASK                  ((uint32_t)0x000000F0U)         /* !< Major rev of the IP */
#define CANFD1_DESC_MAJREV_MINIMUM               ((uint32_t)0x00000000U)         /* !< Smallest value */
#define CANFD1_DESC_MAJREV_MAXIMUM               ((uint32_t)0x000000F0U)         /* !< Highest possible value */
/* CANFD1_DESC[FEATUREVER] Bits */
#define CANFD1_DESC_FEATUREVER_OFS               (12)                            /* !< FEATUREVER Offset */
#define CANFD1_DESC_FEATUREVER_MASK              ((uint32_t)0x0000F000U)         /* !< Feature Set for the module
                                                                                    *instance* */
#define CANFD1_DESC_FEATUREVER_VERSION_0         ((uint32_t)0x00000000U)         /* !< MCAN module with CAN-FD mode
                                                                                    enabled  <<Internal Note: This is an
                                                                                    in-IP paper spin variant. How does
                                                                                    this map to the SYS_MCAN_ENABLE_FD
                                                                                    choice value?>> */
#define CANFD1_DESC_FEATUREVER_VERSION_1         ((uint32_t)0x00001000U)         /* !< MCAN module with CAN-FD mode
                                                                                    disabled  <<Internal Note: This is an
                                                                                    in-IP paper spin variant. How does
                                                                                    this map to the SYS_MCAN_ENABLE_FD
                                                                                    choice value?>> */
/* CANFD1_DESC[MODULEID] Bits */
#define CANFD1_DESC_MODULEID_OFS                 (16)                            /* !< MODULEID Offset */
#define CANFD1_DESC_MODULEID_MASK                ((uint32_t)0xFFFF0000U)         /* !< Module identification contains a
                                                                                    unique peripheral identification
                                                                                    number. The assignments are
                                                                                    maintained in a central database for
                                                                                    all of the platform modules to ensure
                                                                                    uniqueness. */
#define CANFD1_DESC_MODULEID_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define CANFD1_DESC_MODULEID_MAXIMUM             ((uint32_t)0xFFFF0000U)         /* !< Highest possible value */

/* CANFD1_MCANSS_CLKEN Bits */
/* CANFD1_MCANSS_CLKEN[CLK_REQEN] Bits */
#define CANFD1_MCANSS_CLKEN_CLK_REQEN_OFS        (0)                             /* !< CLK_REQEN Offset */
#define CANFD1_MCANSS_CLKEN_CLK_REQEN_MASK       ((uint32_t)0x00000001U)         /* !< MCAN functional and MCAN/MCANSS MMR
                                                                                    clock request enable bit */
#define CANFD1_MCANSS_CLKEN_CLK_REQEN_CLR        ((uint32_t)0x00000000U)         /* !< MCAN module functional clock and
                                                                                    Vbusp is not requested.  These clocks
                                                                                    are gated to the MCAN module. */
#define CANFD1_MCANSS_CLKEN_CLK_REQEN_SET        ((uint32_t)0x00000001U)         /* !< Setting this bit requests MCAN
                                                                                    module functional clock and Vbusp.
                                                                                    These clocks are not gated to MCAN
                                                                                    module. */

/* CANFD1_MCANSS_CLKDIV Bits */
/* CANFD1_MCANSS_CLKDIV[RATIO] Bits */
#define CANFD1_MCANSS_CLKDIV_RATIO_OFS           (0)                             /* !< RATIO Offset */
#define CANFD1_MCANSS_CLKDIV_RATIO_MASK          ((uint32_t)0x00000003U)         /* !< Clock divide ratio specification.
                                                                                    Enables configuring clock divide
                                                                                    settings for the MCAN functional
                                                                                    clock input to the MCAN-SS. */
#define CANFD1_MCANSS_CLKDIV_RATIO_DIV_BY_1_     ((uint32_t)0x00000000U)         /* !< Divides input clock by 1 */
#define CANFD1_MCANSS_CLKDIV_RATIO_DIV_BY_2_     ((uint32_t)0x00000001U)         /* !< Divides input clock by 2 */
#define CANFD1_MCANSS_CLKDIV_RATIO_DIV_BY_4_     ((uint32_t)0x00000002U)         /* !< Divides input clock by 4 */
#define CANFD1_MCANSS_CLKDIV_RATIO_DIV_BY_1_1    ((uint32_t)0x00000003U)         /* !< Divides input clock by 1 */

/* CANFD1_MCANSS_CLKCTL Bits */
/* CANFD1_MCANSS_CLKCTL[STOPREQ] Bits */
#define CANFD1_MCANSS_CLKCTL_STOPREQ_OFS         (0)                             /* !< STOPREQ Offset */
#define CANFD1_MCANSS_CLKCTL_STOPREQ_MASK        ((uint32_t)0x00000001U)         /* !< This bit is used to enable/disable
                                                                                    MCAN clock (both host clock and
                                                                                    functional clock) gating request.
                                                                                    Note: This bit can be reset by HW by
                                                                                    Clock-Stop Wake-up via CAN RX
                                                                                    Activity. See spec for more details. */
#define CANFD1_MCANSS_CLKCTL_STOPREQ_DISABLE     ((uint32_t)0x00000000U)         /* !< Disable MCAN-SS clock stop request */
#define CANFD1_MCANSS_CLKCTL_STOPREQ_ENABLE      ((uint32_t)0x00000001U)         /* !< Enable MCAN-SS clock stop request */
/* CANFD1_MCANSS_CLKCTL[WAKEUP_INT_EN] Bits */
#define CANFD1_MCANSS_CLKCTL_WAKEUP_INT_EN_OFS   (4)                             /* !< WAKEUP_INT_EN Offset */
#define CANFD1_MCANSS_CLKCTL_WAKEUP_INT_EN_MASK  ((uint32_t)0x00000010U)         /* !< This bit contols enabling or
                                                                                    disabling the MCAN IP clock stop
                                                                                    wakeup interrupt (when
                                                                                    MCANSS_CTRL.WAKEUPREQEN wakeup
                                                                                    request is enabled to wakeup MCAN IP
                                                                                    upon CAN RXD activity) */
#define CANFD1_MCANSS_CLKCTL_WAKEUP_INT_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable MCAN IP clock stop wakeup
                                                                                    interrupt */
#define CANFD1_MCANSS_CLKCTL_WAKEUP_INT_EN_ENABLE ((uint32_t)0x00000010U)         /* !< Enable MCAN IP clock stop wakeup
                                                                                    interrupt */
/* CANFD1_MCANSS_CLKCTL[WKUP_GLTFLT_EN] Bits */
#define CANFD1_MCANSS_CLKCTL_WKUP_GLTFLT_EN_OFS  (8)                             /* !< WKUP_GLTFLT_EN Offset */
#define CANFD1_MCANSS_CLKCTL_WKUP_GLTFLT_EN_MASK ((uint32_t)0x00000100U)         /* !< Setting this bit enables the glitch
                                                                                    filter on MCAN RXD input, which wakes
                                                                                    up the MCAN controller to exit clock
                                                                                    gating. */
#define CANFD1_MCANSS_CLKCTL_WKUP_GLTFLT_EN_DISABLE ((uint32_t)0x00000000U)         /* !< Disable glitch filter enable on RXD
                                                                                    input when MCAN is in clock stop mode
                                                                                    (waiting for event on RXD input for
                                                                                    clock stop wakeup). */
#define CANFD1_MCANSS_CLKCTL_WKUP_GLTFLT_EN_ENABLE ((uint32_t)0x00000100U)         /* !< Enable glitch filter enable on RXD
                                                                                    input when MCAN is in clock stop mode
                                                                                    (waiting for event on RXD input for
                                                                                    clock stop wakeup). */

/* CANFD1_MCANSS_CLKSTS Bits */
/* CANFD1_MCANSS_CLKSTS[CLKSTOP_ACKSTS] Bits */
#define CANFD1_MCANSS_CLKSTS_CLKSTOP_ACKSTS_OFS  (0)                             /* !< CLKSTOP_ACKSTS Offset */
#define CANFD1_MCANSS_CLKSTS_CLKSTOP_ACKSTS_MASK ((uint32_t)0x00000001U)         /* !< Clock stop acknowledge status from
                                                                                    MCAN IP */
#define CANFD1_MCANSS_CLKSTS_CLKSTOP_ACKSTS_RESET ((uint32_t)0x00000000U)         /* !< No clock stop acknowledged. */
#define CANFD1_MCANSS_CLKSTS_CLKSTOP_ACKSTS_SET  ((uint32_t)0x00000001U)         /* !< Clock stop has been acknowledged by
                                                                                    MCAN IP; MCAN-SS may be clock gated
                                                                                    by stopping both the CAN host and
                                                                                    functional clocks. */
/* CANFD1_MCANSS_CLKSTS[STOPREQ_HW_OVR] Bits */
#define CANFD1_MCANSS_CLKSTS_STOPREQ_HW_OVR_OFS  (4)                             /* !< STOPREQ_HW_OVR Offset */
#define CANFD1_MCANSS_CLKSTS_STOPREQ_HW_OVR_MASK ((uint32_t)0x00000010U)         /* !< MCANSS clock stop HW override
                                                                                    status bit.   This bit indicates when
                                                                                    the MCANSS_CLKCTL.STOPREQ bit has
                                                                                    been cleared by HW when a clock-stop
                                                                                    wake-up event via CAN RX activity is
                                                                                    triggered. */
#define CANFD1_MCANSS_CLKSTS_STOPREQ_HW_OVR_RESET ((uint32_t)0x00000000U)         /* !< MCANSS_CLKCTL.STOPREQ bit has not
                                                                                    been cleared by HW. */
#define CANFD1_MCANSS_CLKSTS_STOPREQ_HW_OVR_SET  ((uint32_t)0x00000010U)         /* !< MCANSS_CLKCTL.STOPREQ bit has been
                                                                                    cleared by HW. */
/* CANFD1_MCANSS_CLKSTS[CCLKDONE] Bits */
#define CANFD1_MCANSS_CLKSTS_CCLKDONE_OFS        (8)                             /* !< CCLKDONE Offset */
#define CANFD1_MCANSS_CLKSTS_CCLKDONE_MASK       ((uint32_t)0x00000100U)         /* !< This bit indicates the status of
                                                                                    MCAN contoller clock request from
                                                                                    GPRCM. */
#define CANFD1_MCANSS_CLKSTS_CCLKDONE_RESET      ((uint32_t)0x00000000U)         /* !< MCAN controller clock is not
                                                                                    available to the MCAN IP. */
#define CANFD1_MCANSS_CLKSTS_CCLKDONE_SET        ((uint32_t)0x00000100U)         /* !< MCAN controller clock is enabled
                                                                                    and available to the MCAN IP. */

/* CANFD1_MCANERR_REV Bits */
/* CANFD1_MCANERR_REV[REVMIN] Bits */
#define CANFD1_MCANERR_REV_REVMIN_OFS            (0)                             /* !< REVMIN Offset */
#define CANFD1_MCANERR_REV_REVMIN_MASK           ((uint32_t)0x0000003FU)         /* !< Minor Revision of the Error
                                                                                    Aggregator */
/* CANFD1_MCANERR_REV[REVMAJ] Bits */
#define CANFD1_MCANERR_REV_REVMAJ_OFS            (8)                             /* !< REVMAJ Offset */
#define CANFD1_MCANERR_REV_REVMAJ_MASK           ((uint32_t)0x00000700U)         /* !< Major Revision of the Error
                                                                                    Aggregator */
/* CANFD1_MCANERR_REV[MODULE_ID] Bits */
#define CANFD1_MCANERR_REV_MODULE_ID_OFS         (16)                            /* !< MODULE_ID Offset */
#define CANFD1_MCANERR_REV_MODULE_ID_MASK        ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* CANFD1_MCANERR_REV[SCHEME] Bits */
#define CANFD1_MCANERR_REV_SCHEME_OFS            (30)                            /* !< SCHEME Offset */
#define CANFD1_MCANERR_REV_SCHEME_MASK           ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* CANFD1_MCANERR_VECTOR Bits */
/* CANFD1_MCANERR_VECTOR[ECC_VECTOR] Bits */
#define CANFD1_MCANERR_VECTOR_ECC_VECTOR_OFS     (0)                             /* !< ECC_VECTOR Offset */
#define CANFD1_MCANERR_VECTOR_ECC_VECTOR_MASK    ((uint32_t)0x000007FFU)         /* !< ECC RAM ID. Each error detection
                                                                                    and correction (EDC) controller has a
                                                                                    bank of error registers (offsets 0x10
                                                                                    - 0x3B) associated with it. These
                                                                                    registers are accessed via an
                                                                                    internal serial bus (SVBUS). To
                                                                                    access them through the ECC
                                                                                    aggregator the controller ID desired
                                                                                    must be written to the ECC_VECTOR
                                                                                    field, together with the RD_SVBUS
                                                                                    trigger and RD_SVBUS_ADDRESS bit
                                                                                    field. This initiates the serial read
                                                                                    which consummates by setting the
                                                                                    RD_SVBUS_DONE bit. At this point the
                                                                                    addressed register may be read by a
                                                                                    normal CPU read of the appropriate
                                                                                    offset address.   0x000  Message RAM
                                                                                    ECC controller is selected   Others
                                                                                    Reserved (do not use)   Subsequent
                                                                                    writes through the SVBUS (offsets
                                                                                    0x10 - 0x3B) have a delayed
                                                                                    completion. To avoid conflicts,
                                                                                    perform a read back of a register
                                                                                    within this range after writing. */
/* CANFD1_MCANERR_VECTOR[RD_SVBUS] Bits */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_OFS       (15)                            /* !< RD_SVBUS Offset */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_MASK      ((uint32_t)0x00008000U)         /* !< Read Trigger */
/* CANFD1_MCANERR_VECTOR[RD_SVBUS_ADDRESS] Bits */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_ADDRESS_OFS (16)                            /* !< RD_SVBUS_ADDRESS Offset */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_ADDRESS_MASK ((uint32_t)0x00FF0000U)         /* !< Read Address Offset */
/* CANFD1_MCANERR_VECTOR[RD_SVBUS_DONE] Bits */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_DONE_OFS  (24)                            /* !< RD_SVBUS_DONE Offset */
#define CANFD1_MCANERR_VECTOR_RD_SVBUS_DONE_MASK ((uint32_t)0x01000000U)         /* !< Read Completion Flag */

