TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCANERR_STAT Bits */
/* CANFD1_MCANERR_STAT[NUM_RAMS] Bits */
#define CANFD1_MCANERR_STAT_NUM_RAMS_OFS         (0)                             /* !< NUM_RAMS Offset */
#define CANFD1_MCANERR_STAT_NUM_RAMS_MASK        ((uint32_t)0x000007FFU)         /* !< Number of RAMs. Number of ECC RAMs
                                                                                    serviced by the aggregator. */

/* CANFD1_MCANERR_WRAP_REV Bits */
/* CANFD1_MCANERR_WRAP_REV[REVMIN] Bits */
#define CANFD1_MCANERR_WRAP_REV_REVMIN_OFS       (0)                             /* !< REVMIN Offset */
#define CANFD1_MCANERR_WRAP_REV_REVMIN_MASK      ((uint32_t)0x0000003FU)         /* !< Minor Revision of the Error
                                                                                    Aggregator */
/* CANFD1_MCANERR_WRAP_REV[REVMAJ] Bits */
#define CANFD1_MCANERR_WRAP_REV_REVMAJ_OFS       (8)                             /* !< REVMAJ Offset */
#define CANFD1_MCANERR_WRAP_REV_REVMAJ_MASK      ((uint32_t)0x00000700U)         /* !< Major Revision of the Error
                                                                                    Aggregator */
/* CANFD1_MCANERR_WRAP_REV[MODULE_ID] Bits */
#define CANFD1_MCANERR_WRAP_REV_MODULE_ID_OFS    (16)                            /* !< MODULE_ID Offset */
#define CANFD1_MCANERR_WRAP_REV_MODULE_ID_MASK   ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* CANFD1_MCANERR_WRAP_REV[SCHEME] Bits */
#define CANFD1_MCANERR_WRAP_REV_SCHEME_OFS       (30)                            /* !< SCHEME Offset */
#define CANFD1_MCANERR_WRAP_REV_SCHEME_MASK      ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* CANFD1_MCANERR_CTRL Bits */
/* CANFD1_MCANERR_CTRL[ECC_ENABLE] Bits */
#define CANFD1_MCANERR_CTRL_ECC_ENABLE_OFS       (0)                             /* !< ECC_ENABLE Offset */
#define CANFD1_MCANERR_CTRL_ECC_ENABLE_MASK      ((uint32_t)0x00000001U)         /* !< Enable ECC Generation */
/* CANFD1_MCANERR_CTRL[ECC_CHECK] Bits */
#define CANFD1_MCANERR_CTRL_ECC_CHECK_OFS        (1)                             /* !< ECC_CHECK Offset */
#define CANFD1_MCANERR_CTRL_ECC_CHECK_MASK       ((uint32_t)0x00000002U)         /* !< Enable ECC Check. ECC is completely
                                                                                    bypassed if both ECC_ENABLE and
                                                                                    ECC_CHECK are '0'. */
/* CANFD1_MCANERR_CTRL[ENABLE_RMW] Bits */
#define CANFD1_MCANERR_CTRL_ENABLE_RMW_OFS       (2)                             /* !< ENABLE_RMW Offset */
#define CANFD1_MCANERR_CTRL_ENABLE_RMW_MASK      ((uint32_t)0x00000004U)         /* !< Enable read-modify-write on partial
                                                                                    word writes */
/* CANFD1_MCANERR_CTRL[FORCE_SEC] Bits */
#define CANFD1_MCANERR_CTRL_FORCE_SEC_OFS        (3)                             /* !< FORCE_SEC Offset */
#define CANFD1_MCANERR_CTRL_FORCE_SEC_MASK       ((uint32_t)0x00000008U)         /* !< Force single-bit error. Cleared on
                                                                                    a writeback or the cycle following
                                                                                    the error if ERROR_ONCE is asserted.
                                                                                    For write through mode, this applies
                                                                                    to writes as well as reads.
                                                                                    MCANERR_ERR_CTRL1 and
                                                                                    MCANERR_ERR_CTRL2 should be
                                                                                    configured prior to setting this bit. */
/* CANFD1_MCANERR_CTRL[FORCE_DED] Bits */
#define CANFD1_MCANERR_CTRL_FORCE_DED_OFS        (4)                             /* !< FORCE_DED Offset */
#define CANFD1_MCANERR_CTRL_FORCE_DED_MASK       ((uint32_t)0x00000010U)         /* !< Force double-bit error. Cleared the
                                                                                    cycle following the error if
                                                                                    ERROR_ONCE is asserted. For write
                                                                                    through mode, this applies to writes
                                                                                    as well as reads. MCANERR_ERR_CTRL1
                                                                                    and MCANERR_ERR_CTRL2 should be
                                                                                    configured prior to setting this bit. */
/* CANFD1_MCANERR_CTRL[FORCE_N_ROW] Bits */
#define CANFD1_MCANERR_CTRL_FORCE_N_ROW_OFS      (5)                             /* !< FORCE_N_ROW Offset */
#define CANFD1_MCANERR_CTRL_FORCE_N_ROW_MASK     ((uint32_t)0x00000020U)         /* !< Enable single/double-bit error on
                                                                                    the next RAM read, regardless of the
                                                                                    MCANERR_ERR_CTRL1.ECC_ROW setting.
                                                                                    For write through mode, this applies
                                                                                    to writes as well as reads. */
/* CANFD1_MCANERR_CTRL[ERROR_ONCE] Bits */
#define CANFD1_MCANERR_CTRL_ERROR_ONCE_OFS       (6)                             /* !< ERROR_ONCE Offset */
#define CANFD1_MCANERR_CTRL_ERROR_ONCE_MASK      ((uint32_t)0x00000040U)         /* !< If this bit is set, the
                                                                                    FORCE_SEC/FORCE_DED will inject an
                                                                                    error to the specified row only once.
                                                                                    The FORCE_SEC bit will be cleared
                                                                                    once a writeback happens. If
                                                                                    writeback is not enabled, this error
                                                                                    will be cleared the cycle following
                                                                                    the read when the data is corrected.
                                                                                    For double-bit errors, the FORCE_DED
                                                                                    bit will be cleared the cycle
                                                                                    following the double-bit error. Any
                                                                                    subsequent reads will not force an
                                                                                    error. */
/* CANFD1_MCANERR_CTRL[CHECK_SVBUS_TIMEOUT] Bits */
#define CANFD1_MCANERR_CTRL_CHECK_SVBUS_TIMEOUT_OFS (8)                             /* !< CHECK_SVBUS_TIMEOUT Offset */
#define CANFD1_MCANERR_CTRL_CHECK_SVBUS_TIMEOUT_MASK ((uint32_t)0x00000100U)         /* !< Enables Serial VBUS timeout
                                                                                    mechanism */

/* CANFD1_MCANERR_ERR_CTRL1 Bits */
/* CANFD1_MCANERR_ERR_CTRL1[ECC_ROW] Bits */
#define CANFD1_MCANERR_ERR_CTRL1_ECC_ROW_OFS     (0)                             /* !< ECC_ROW Offset */
#define CANFD1_MCANERR_ERR_CTRL1_ECC_ROW_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Row address where FORCE_SEC or
                                                                                    FORCE_DED needs to be applied. This
                                                                                    is ignored if FORCE_N_ROW is set. */

/* CANFD1_MCANERR_ERR_CTRL2 Bits */
/* CANFD1_MCANERR_ERR_CTRL2[ECC_BIT1] Bits */
#define CANFD1_MCANERR_ERR_CTRL2_ECC_BIT1_OFS    (0)                             /* !< ECC_BIT1 Offset */
#define CANFD1_MCANERR_ERR_CTRL2_ECC_BIT1_MASK   ((uint32_t)0x0000FFFFU)         /* !< Column/Data bit that needs to be
                                                                                    flipped when FORCE_SEC or FORCE_DED
                                                                                    is set */
/* CANFD1_MCANERR_ERR_CTRL2[ECC_BIT2] Bits */
#define CANFD1_MCANERR_ERR_CTRL2_ECC_BIT2_OFS    (16)                            /* !< ECC_BIT2 Offset */
#define CANFD1_MCANERR_ERR_CTRL2_ECC_BIT2_MASK   ((uint32_t)0xFFFF0000U)         /* !< Second column/data bit that needs
                                                                                    to be flipped when FORCE_DED is set */

/* CANFD1_MCANERR_ERR_STAT1 Bits */
/* CANFD1_MCANERR_ERR_STAT1[ECC_SEC] Bits */
#define CANFD1_MCANERR_ERR_STAT1_ECC_SEC_OFS     (0)                             /* !< ECC_SEC Offset */
#define CANFD1_MCANERR_ERR_STAT1_ECC_SEC_MASK    ((uint32_t)0x00000003U)         /* !< Single Bit Error Corrected Status.
                                                                                    A 2-bit saturating counter of the
                                                                                    number of SEC errors that have
                                                                                    occurred since last cleared.     0
                                                                                    No single-bit error detected   1  One
                                                                                    single-bit error was detected and
                                                                                    corrected   2  Two single-bit errors
                                                                                    were detected and corrected   3
                                                                                    Three single-bit errors were detected
                                                                                    and corrected   A write of a non-zero
                                                                                    value to this bit field increments it
                                                                                    by the value provided. */
/* CANFD1_MCANERR_ERR_STAT1[ECC_DED] Bits */
#define CANFD1_MCANERR_ERR_STAT1_ECC_DED_OFS     (2)                             /* !< ECC_DED Offset */
#define CANFD1_MCANERR_ERR_STAT1_ECC_DED_MASK    ((uint32_t)0x0000000CU)         /* !< Double Bit Error Detected Status. A
                                                                                    2-bit saturating counter of the
                                                                                    number of DED errors that have
                                                                                    occurred since last cleared.     0
                                                                                    No double-bit error detected   1  One
                                                                                    double-bit error was detected   2
                                                                                    Two double-bit errors were detected
                                                                                    3  Three double-bit errors were
                                                                                    detected   A write of a non-zero
                                                                                    value to this bit field increments it
                                                                                    by the value provided. */
/* CANFD1_MCANERR_ERR_STAT1[ECC_OTHER] Bits */
#define CANFD1_MCANERR_ERR_STAT1_ECC_OTHER_OFS   (4)                             /* !< ECC_OTHER Offset */
#define CANFD1_MCANERR_ERR_STAT1_ECC_OTHER_MASK  ((uint32_t)0x00000010U)         /* !< SEC While Writeback Error Status
                                                                                    0  No SEC error while writeback
                                                                                    pending   1  Indicates that
                                                                                    successive single-bit errors have
                                                                                    occurred while a writeback is still
                                                                                    pending */
/* CANFD1_MCANERR_ERR_STAT1[CTRL_REG_ERROR] Bits */
#define CANFD1_MCANERR_ERR_STAT1_CTRL_REG_ERROR_OFS (7)                             /* !< CTRL_REG_ERROR Offset */
#define CANFD1_MCANERR_ERR_STAT1_CTRL_REG_ERROR_MASK ((uint32_t)0x00000080U)         /* !< Control Register Error. A bit field
                                                                                    in the control register is in an
                                                                                    ambiguous state. This means that the
                                                                                    redundancy registers have detected a
                                                                                    state where not all values are the
                                                                                    same and has defaulted to the reset
                                                                                    state. S/W needs to re-write these
                                                                                    registers to a known state. A write
                                                                                    of 1 will set this interrupt flag. */
/* CANFD1_MCANERR_ERR_STAT1[CLR_ECC_SEC] Bits */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_SEC_OFS (8)                             /* !< CLR_ECC_SEC Offset */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_SEC_MASK ((uint32_t)0x00000300U)         /* !< Clear ECC_SEC. A write of a
                                                                                    non-zero value to this bit field
                                                                                    decrements the ECC_SEC bit field by
                                                                                    the value provided. */
/* CANFD1_MCANERR_ERR_STAT1[CLR_ECC_DED] Bits */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_DED_OFS (10)                            /* !< CLR_ECC_DED Offset */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_DED_MASK ((uint32_t)0x00000C00U)         /* !< Clear ECC_DED. A write of a
                                                                                    non-zero value to this bit field
                                                                                    decrements the ECC_DED bit field by
                                                                                    the value provided. */
/* CANFD1_MCANERR_ERR_STAT1[CLR_ECC_OTHER] Bits */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_OTHER_OFS (12)                            /* !< CLR_ECC_OTHER Offset */
#define CANFD1_MCANERR_ERR_STAT1_CLR_ECC_OTHER_MASK ((uint32_t)0x00001000U)         /* !< Writing a '1' clears the ECC_OTHER
                                                                                    bit. */
/* CANFD1_MCANERR_ERR_STAT1[CLR_CTRL_REG_ERROR] Bits */
#define CANFD1_MCANERR_ERR_STAT1_CLR_CTRL_REG_ERROR_OFS (15)                            /* !< CLR_CTRL_REG_ERROR Offset */
#define CANFD1_MCANERR_ERR_STAT1_CLR_CTRL_REG_ERROR_MASK ((uint32_t)0x00008000U)         /* !< Writing a '1' clears the
                                                                                    CTRL_REG_ERROR bit */
/* CANFD1_MCANERR_ERR_STAT1[ECC_BIT1] Bits */
#define CANFD1_MCANERR_ERR_STAT1_ECC_BIT1_OFS    (16)                            /* !< ECC_BIT1 Offset */
#define CANFD1_MCANERR_ERR_STAT1_ECC_BIT1_MASK   ((uint32_t)0xFFFF0000U)         /* !< ECC Error Bit Position. Indicates
                                                                                    the bit position in the RAM data that
                                                                                    is in error on an SEC error. Only
                                                                                    valid on an SEC error.   0  Bit 0 is
                                                                                    in error   1  Bit 1 is in error   2
                                                                                    Bit 2 is in error   3  Bit 3 is in
                                                                                    error   ...   31 Bit 31 is in error
                                                                                    >32 Invalid */

/* CANFD1_MCANERR_ERR_STAT2 Bits */
/* CANFD1_MCANERR_ERR_STAT2[ECC_ROW] Bits */
#define CANFD1_MCANERR_ERR_STAT2_ECC_ROW_OFS     (0)                             /* !< ECC_ROW Offset */
#define CANFD1_MCANERR_ERR_STAT2_ECC_ROW_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< Indicates the row address where the
                                                                                    single or double-bit error occurred.
                                                                                    This value is address offset/4. */

