TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCANERR_ERR_STAT3 Bits */
/* CANFD1_MCANERR_ERR_STAT3[WB_PEND] Bits */
#define CANFD1_MCANERR_ERR_STAT3_WB_PEND_OFS     (0)                             /* !< WB_PEND Offset */
#define CANFD1_MCANERR_ERR_STAT3_WB_PEND_MASK    ((uint32_t)0x00000001U)         /* !< Delayed Write Back Pending Status
                                                                                    0  No write back pending   1  An ECC
                                                                                    data correction write back is pending */
/* CANFD1_MCANERR_ERR_STAT3[SVBUS_TIMEOUT] Bits */
#define CANFD1_MCANERR_ERR_STAT3_SVBUS_TIMEOUT_OFS (1)                             /* !< SVBUS_TIMEOUT Offset */
#define CANFD1_MCANERR_ERR_STAT3_SVBUS_TIMEOUT_MASK ((uint32_t)0x00000002U)         /* !< Serial VBUS Timeout Flag. Write 1
                                                                                    to set. */
/* CANFD1_MCANERR_ERR_STAT3[CLR_SVBUS_TIMEOUT] Bits */
#define CANFD1_MCANERR_ERR_STAT3_CLR_SVBUS_TIMEOUT_OFS (9)                             /* !< CLR_SVBUS_TIMEOUT Offset */
#define CANFD1_MCANERR_ERR_STAT3_CLR_SVBUS_TIMEOUT_MASK ((uint32_t)0x00000200U)         /* !< Write 1 to clear the Serial VBUS
                                                                                    Timeout Flag */

/* CANFD1_MCANERR_SEC_EOI Bits */
/* CANFD1_MCANERR_SEC_EOI[EOI_WR] Bits */
#define CANFD1_MCANERR_SEC_EOI_EOI_WR_OFS        (0)                             /* !< EOI_WR Offset */
#define CANFD1_MCANERR_SEC_EOI_EOI_WR_MASK       ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_SEC goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* CANFD1_MCANERR_SEC_STATUS Bits */
/* CANFD1_MCANERR_SEC_STATUS[MSGMEM_PEND] Bits */
#define CANFD1_MCANERR_SEC_STATUS_MSGMEM_PEND_OFS (0)                             /* !< MSGMEM_PEND Offset */
#define CANFD1_MCANERR_SEC_STATUS_MSGMEM_PEND_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    0  No SEC interrupt is pending   1
                                                                                    SEC interrupt is pending */

/* CANFD1_MCANERR_SEC_ENABLE_SET Bits */
/* CANFD1_MCANERR_SEC_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define CANFD1_MCANERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define CANFD1_MCANERR_SEC_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD1_MCANERR_SEC_ENABLE_CLR Bits */
/* CANFD1_MCANERR_SEC_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define CANFD1_MCANERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define CANFD1_MCANERR_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD1_MCANERR_DED_EOI Bits */
/* CANFD1_MCANERR_DED_EOI[EOI_WR] Bits */
#define CANFD1_MCANERR_DED_EOI_EOI_WR_OFS        (0)                             /* !< EOI_WR Offset */
#define CANFD1_MCANERR_DED_EOI_EOI_WR_MASK       ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_DED goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* CANFD1_MCANERR_DED_STATUS Bits */
/* CANFD1_MCANERR_DED_STATUS[MSGMEM_PEND] Bits */
#define CANFD1_MCANERR_DED_STATUS_MSGMEM_PEND_OFS (0)                             /* !< MSGMEM_PEND Offset */
#define CANFD1_MCANERR_DED_STATUS_MSGMEM_PEND_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    0  No DED interrupt is pending   1
                                                                                    DED interrupt is pending */

