TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCANERR_DED_ENABLE_SET Bits */
/* CANFD1_MCANERR_DED_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define CANFD1_MCANERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define CANFD1_MCANERR_DED_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD1_MCANERR_DED_ENABLE_CLR Bits */
/* CANFD1_MCANERR_DED_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define CANFD1_MCANERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define CANFD1_MCANERR_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* CANFD1_MCANERR_AGGR_ENABLE_SET Bits */
/* CANFD1_MCANERR_AGGR_ENABLE_SET[ENABLE_PARITY_SET] Bits */
#define CANFD1_MCANERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET_OFS (0)                             /* !< ENABLE_PARITY_SET Offset */
#define CANFD1_MCANERR_AGGR_ENABLE_SET_ENABLE_PARITY_SET_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to enable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* CANFD1_MCANERR_AGGR_ENABLE_SET[ENABLE_TIMEOUT_SET] Bits */
#define CANFD1_MCANERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_OFS (1)                             /* !< ENABLE_TIMEOUT_SET Offset */
#define CANFD1_MCANERR_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to enable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

/* CANFD1_MCANERR_AGGR_ENABLE_CLR Bits */
/* CANFD1_MCANERR_AGGR_ENABLE_CLR[ENABLE_PARITY_CLR] Bits */
#define CANFD1_MCANERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_OFS (0)                             /* !< ENABLE_PARITY_CLR Offset */
#define CANFD1_MCANERR_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to disable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* CANFD1_MCANERR_AGGR_ENABLE_CLR[ENABLE_TIMEOUT_CLR] Bits */
#define CANFD1_MCANERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_OFS (1)                             /* !< ENABLE_TIMEOUT_CLR Offset */
#define CANFD1_MCANERR_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to disable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

/* CANFD1_MCANERR_AGGR_STATUS_SET Bits */
/* CANFD1_MCANERR_AGGR_STATUS_SET[AGGR_PARITY_ERR] Bits */
#define CANFD1_MCANERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define CANFD1_MCANERR_AGGR_STATUS_SET_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */
/* CANFD1_MCANERR_AGGR_STATUS_SET[SVBUS_TIMEOUT] Bits */
#define CANFD1_MCANERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_OFS (2)                             /* !< SVBUS_TIMEOUT Offset */
#define CANFD1_MCANERR_AGGR_STATUS_SET_SVBUS_TIMEOUT_MASK ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */

/* CANFD1_MCANERR_AGGR_STATUS_CLR Bits */
/* CANFD1_MCANERR_AGGR_STATUS_CLR[AGGR_PARITY_ERR] Bits */
#define CANFD1_MCANERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define CANFD1_MCANERR_AGGR_STATUS_CLR_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */
/* CANFD1_MCANERR_AGGR_STATUS_CLR[SVBUS_TIMEOUT] Bits */
#define CANFD1_MCANERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_OFS (2)                             /* !< SVBUS_TIMEOUT Offset */
#define CANFD1_MCANERR_AGGR_STATUS_CLR_SVBUS_TIMEOUT_MASK ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */

/* CANFD1_MCANSS_PID Bits */
/* CANFD1_MCANSS_PID[MINOR] Bits */
#define CANFD1_MCANSS_PID_MINOR_OFS              (0)                             /* !< MINOR Offset */
#define CANFD1_MCANSS_PID_MINOR_MASK             ((uint32_t)0x0000003FU)         /* !< Minor Revision of the MCAN
                                                                                    Subsystem */
/* CANFD1_MCANSS_PID[MAJOR] Bits */
#define CANFD1_MCANSS_PID_MAJOR_OFS              (8)                             /* !< MAJOR Offset */
#define CANFD1_MCANSS_PID_MAJOR_MASK             ((uint32_t)0x00000700U)         /* !< Major Revision of the MCAN
                                                                                    Subsystem */
/* CANFD1_MCANSS_PID[MODULE_ID] Bits */
#define CANFD1_MCANSS_PID_MODULE_ID_OFS          (16)                            /* !< MODULE_ID Offset */
#define CANFD1_MCANSS_PID_MODULE_ID_MASK         ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* CANFD1_MCANSS_PID[SCHEME] Bits */
#define CANFD1_MCANSS_PID_SCHEME_OFS             (30)                            /* !< SCHEME Offset */
#define CANFD1_MCANSS_PID_SCHEME_MASK            ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* CANFD1_MCANSS_CTRL Bits */
/* CANFD1_MCANSS_CTRL[DBGSUSP_FREE] Bits */
#define CANFD1_MCANSS_CTRL_DBGSUSP_FREE_OFS      (3)                             /* !< DBGSUSP_FREE Offset */
#define CANFD1_MCANSS_CTRL_DBGSUSP_FREE_MASK     ((uint32_t)0x00000008U)         /* !< Debug Suspend Free Bit. Enables
                                                                                    debug suspend.   0  Honor debug
                                                                                    suspend   1  Disregard debug suspend */
/* CANFD1_MCANSS_CTRL[WAKEUPREQEN] Bits */
#define CANFD1_MCANSS_CTRL_WAKEUPREQEN_OFS       (4)                             /* !< WAKEUPREQEN Offset */
#define CANFD1_MCANSS_CTRL_WAKEUPREQEN_MASK      ((uint32_t)0x00000010U)         /* !< Wakeup Request Enable. Enables the
                                                                                    MCANSS to wakeup on CAN RXD activity.
                                                                                    0  Disable wakeup request   1
                                                                                    Enables wakeup request */
/* CANFD1_MCANSS_CTRL[AUTOWAKEUP] Bits */
#define CANFD1_MCANSS_CTRL_AUTOWAKEUP_OFS        (5)                             /* !< AUTOWAKEUP Offset */
#define CANFD1_MCANSS_CTRL_AUTOWAKEUP_MASK       ((uint32_t)0x00000020U)         /* !< Automatic Wakeup Enable. Enables
                                                                                    the MCANSS to automatically clear the
                                                                                    MCAN CCCR.INIT bit, fully waking the
                                                                                    MCAN up, on an enabled wakeup
                                                                                    request.   0  Disable the automatic
                                                                                    write to CCCR.INIT   1  Enable the
                                                                                    automatic write to CCCR.INIT */
/* CANFD1_MCANSS_CTRL[EXT_TS_CNTR_EN] Bits */
#define CANFD1_MCANSS_CTRL_EXT_TS_CNTR_EN_OFS    (6)                             /* !< EXT_TS_CNTR_EN Offset */
#define CANFD1_MCANSS_CTRL_EXT_TS_CNTR_EN_MASK   ((uint32_t)0x00000040U)         /* !< External Timestamp Counter Enable.
                                                                                    0  External timestamp counter
                                                                                    disabled   1  External timestamp
                                                                                    counter enabled */

