TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCANSS_STAT Bits */
/* CANFD1_MCANSS_STAT[RESET] Bits */
#define CANFD1_MCANSS_STAT_RESET_OFS             (0)                             /* !< RESET Offset */
#define CANFD1_MCANSS_STAT_RESET_MASK            ((uint32_t)0x00000001U)         /* !< Soft Reset Status.   0  Not in
                                                                                    reset   1  Reset is in progress */
/* CANFD1_MCANSS_STAT[MEM_INIT_DONE] Bits */
#define CANFD1_MCANSS_STAT_MEM_INIT_DONE_OFS     (1)                             /* !< MEM_INIT_DONE Offset */
#define CANFD1_MCANSS_STAT_MEM_INIT_DONE_MASK    ((uint32_t)0x00000002U)         /* !< Memory Initialization Done.   0
                                                                                    Message RAM initialization is in
                                                                                    progress   1  Message RAM is
                                                                                    initialized for use */
/* CANFD1_MCANSS_STAT[ENABLE_FDOE] Bits */
#define CANFD1_MCANSS_STAT_ENABLE_FDOE_OFS       (2)                             /* !< ENABLE_FDOE Offset */
#define CANFD1_MCANSS_STAT_ENABLE_FDOE_MASK      ((uint32_t)0x00000004U)         /* !< Enable FD (Flexible Data-Rate)
                                                                                    Configuration Reflects the value of
                                                                                    mcanss_enable_fdoe configuration
                                                                                    port, -h = mcanss_enable_fdoe. */

/* CANFD1_MCANSS_ICS Bits */
/* CANFD1_MCANSS_ICS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MCANSS_ICS_EXT_TS_CNTR_OVFL_OFS   (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MCANSS_ICS_EXT_TS_CNTR_OVFL_MASK  ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status Clear. Reads always
                                                                                    return a 0.   0  Write of '0' has no
                                                                                    effect   1  Write of '1' clears the
                                                                                    MCANSS_IRS.EXT_TS_CNTR_OVFL bit */

/* CANFD1_MCANSS_IRS Bits */
/* CANFD1_MCANSS_IRS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MCANSS_IRS_EXT_TS_CNTR_OVFL_OFS   (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MCANSS_IRS_EXT_TS_CNTR_OVFL_MASK  ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status. This bit is set by
                                                                                    HW or by a SW write of '1'. To clear,
                                                                                    use the MCANSS_ICS.EXT_TS_CNTR_OVFL
                                                                                    bit.   0  External timestamp counter
                                                                                    has not overflowed   1  External
                                                                                    timestamp counter has overflowed
                                                                                    When this bit is set to '1' by HW or
                                                                                    SW, the
                                                                                    MCANSS_EXT_TS_UNSERVICED_INTR_CNTR
                                                                                    .EXT_TS_INTR_CNTR bit field will
                                                                                    increment by 1. */

/* CANFD1_MCANSS_IECS Bits */
/* CANFD1_MCANSS_IECS[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MCANSS_IECS_EXT_TS_CNTR_OVFL_OFS  (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MCANSS_IECS_EXT_TS_CNTR_OVFL_MASK ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable Clear. Reads always
                                                                                    return a 0.   0  Write of '0' has no
                                                                                    effect   1  Write of '1' clears the
                                                                                    MCANSS_IES.EXT_TS_CNTR_OVFL bit */

/* CANFD1_MCANSS_IE Bits */
/* CANFD1_MCANSS_IE[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MCANSS_IE_EXT_TS_CNTR_OVFL_OFS    (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MCANSS_IE_EXT_TS_CNTR_OVFL_MASK   ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable. A write of '0' has
                                                                                    no effect. A write of '1' sets the
                                                                                    MCANSS_IES.EXT_TS_CNTR_OVFL bit. */

/* CANFD1_MCANSS_IES Bits */
/* CANFD1_MCANSS_IES[EXT_TS_CNTR_OVFL] Bits */
#define CANFD1_MCANSS_IES_EXT_TS_CNTR_OVFL_OFS   (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define CANFD1_MCANSS_IES_EXT_TS_CNTR_OVFL_MASK  ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable Status. To set, use
                                                                                    the CANSS_IE.EXT_TS_CNTR_OVFL bit. To
                                                                                    clear, use the
                                                                                    MCANSS_IECS.EXT_TS_CNTR_OVFL bit.   0
                                                                                    External timestamp counter overflow
                                                                                    interrupt is not enabled   1
                                                                                    External timestamp counter overflow
                                                                                    interrupt is enabled */

