TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCANSS_EOI Bits */
/* CANFD1_MCANSS_EOI[EOI] Bits */
#define CANFD1_MCANSS_EOI_EOI_OFS                (0)                             /* !< EOI Offset */
#define CANFD1_MCANSS_EOI_EOI_MASK               ((uint32_t)0x000000FFU)         /* !< End of Interrupt. A write to this
                                                                                    register will clear the associated
                                                                                    interrupt. If the unserviced
                                                                                    interrupt counter is > 1, another
                                                                                    interrupt is generated.   0x00
                                                                                    External TS Interrupt is cleared
                                                                                    0x01  MCAN(0) interrupt is cleared
                                                                                    0x02  MCAN(1) interrupt is cleared
                                                                                    Other writes are ignored. */

/* CANFD1_MCANSS_EXT_TS_PRESCALER Bits */
/* CANFD1_MCANSS_EXT_TS_PRESCALER[PRESCALER] Bits */
#define CANFD1_MCANSS_EXT_TS_PRESCALER_PRESCALER_OFS (0)                             /* !< PRESCALER Offset */
#define CANFD1_MCANSS_EXT_TS_PRESCALER_PRESCALER_MASK ((uint32_t)0x00FFFFFFU)         /* !< External Timestamp Prescaler Reload
                                                                                    Value. The external timestamp count
                                                                                    rate is the host (system) clock rate
                                                                                    divided by this value, except in the
                                                                                    case of 0. A zero value in this bit
                                                                                    field will act identically to a value
                                                                                    of 0x000001. */

/* CANFD1_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR Bits */
/* CANFD1_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR[EXT_TS_INTR_CNTR] Bits */
#define CANFD1_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_OFS (0)                             /* !< EXT_TS_INTR_CNTR Offset */
#define CANFD1_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_MASK ((uint32_t)0x0000001FU)         /* !< External Timestamp Counter
                                                                                    Unserviced Rollover Interrupts. If
                                                                                    this value is > 1, an MCANSS_EOI
                                                                                    write of '1' to bit 0 will issue
                                                                                    another interrupt.   The status of
                                                                                    this bit field is affected by the
                                                                                    MCANSS_IRS.EXT_TS_CNTR_OVFL bit
                                                                                    field. */

/* CANFD1_MCAN_CREL Bits */
/* CANFD1_MCAN_CREL[DAY] Bits */
#define CANFD1_MCAN_CREL_DAY_OFS                 (0)                             /* !< DAY Offset */
#define CANFD1_MCAN_CREL_DAY_MASK                ((uint32_t)0x000000FFU)         /* !< Time Stamp Day. Two digits,
                                                                                    BCD-coded. */
/* CANFD1_MCAN_CREL[MON] Bits */
#define CANFD1_MCAN_CREL_MON_OFS                 (8)                             /* !< MON Offset */
#define CANFD1_MCAN_CREL_MON_MASK                ((uint32_t)0x0000FF00U)         /* !< Time Stamp Month. Two digits,
                                                                                    BCD-coded. */
/* CANFD1_MCAN_CREL[YEAR] Bits */
#define CANFD1_MCAN_CREL_YEAR_OFS                (16)                            /* !< YEAR Offset */
#define CANFD1_MCAN_CREL_YEAR_MASK               ((uint32_t)0x000F0000U)         /* !< Time Stamp Year. One digit,
                                                                                    BCD-coded. */
/* CANFD1_MCAN_CREL[SUBSTEP] Bits */
#define CANFD1_MCAN_CREL_SUBSTEP_OFS             (20)                            /* !< SUBSTEP Offset */
#define CANFD1_MCAN_CREL_SUBSTEP_MASK            ((uint32_t)0x00F00000U)         /* !< Sub-Step of Core Release. One
                                                                                    digit, BCD-coded. */
/* CANFD1_MCAN_CREL[STEP] Bits */
#define CANFD1_MCAN_CREL_STEP_OFS                (24)                            /* !< STEP Offset */
#define CANFD1_MCAN_CREL_STEP_MASK               ((uint32_t)0x0F000000U)         /* !< Step of Core Release. One digit,
                                                                                    BCD-coded. */
/* CANFD1_MCAN_CREL[REL] Bits */
#define CANFD1_MCAN_CREL_REL_OFS                 (28)                            /* !< REL Offset */
#define CANFD1_MCAN_CREL_REL_MASK                ((uint32_t)0xF0000000U)         /* !< Core Release. One digit, BCD-coded. */

/* CANFD1_MCAN_ENDN Bits */
/* CANFD1_MCAN_ENDN[ETV] Bits */
#define CANFD1_MCAN_ENDN_ETV_OFS                 (0)                             /* !< ETV Offset */
#define CANFD1_MCAN_ENDN_ETV_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< Endianess Test Value. Reading the
                                                                                    constant value maintained in this
                                                                                    register allows software to determine
                                                                                    the endianess of the host CPU. */

