TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCAN_TSCV Bits */
/* CANFD1_MCAN_TSCV[TSC] Bits */
#define CANFD1_MCAN_TSCV_TSC_OFS                 (0)                             /* !< TSC Offset */
#define CANFD1_MCAN_TSCV_TSC_MASK                ((uint32_t)0x0000FFFFU)         /* !< Timestamp Counter. The
                                                                                    internal/external Timestamp Counter
                                                                                    value is captured on start of frame
                                                                                    (both Rx and Tx). When TSCC.TSS =
                                                                                    "01", the Timestamp Counter is
                                                                                    incremented in multiples of CAN bit
                                                                                    times, (1...16), depending on the
                                                                                    configuration of TSCC.TCP. A wrap
                                                                                    around sets interrupt flag IR.TSW.
                                                                                    Write access resets the counter to
                                                                                    zero. When TSCC.TSS = "10", TSC
                                                                                    reflects the External Timestamp
                                                                                    Counter value, and a write access has
                                                                                    no impact.   Note: A "wrap around" is
                                                                                    a change of the Timestamp Counter
                                                                                    value from non-zero to zero not
                                                                                    caused by write access to MCAN_TSCV. */

/* CANFD1_MCAN_TOCC Bits */
/* CANFD1_MCAN_TOCC[ETOC] Bits */
#define CANFD1_MCAN_TOCC_ETOC_OFS                (0)                             /* !< ETOC Offset */
#define CANFD1_MCAN_TOCC_ETOC_MASK               ((uint32_t)0x00000001U)         /* !< Enable Timeout Counter   0  Timeout
                                                                                    Counter disabled   1  Timeout Counter
                                                                                    enabled   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* CANFD1_MCAN_TOCC[TOS] Bits */
#define CANFD1_MCAN_TOCC_TOS_OFS                 (1)                             /* !< TOS Offset */
#define CANFD1_MCAN_TOCC_TOS_MASK                ((uint32_t)0x00000006U)         /* !< Timeout Select. When operating in
                                                                                    Continuous mode, a write to TOCV
                                                                                    presets the counter to the value
                                                                                    configured by TOCC.TOP and continues
                                                                                    down-counting. When the Timeout
                                                                                    Counter is controlled by one of the
                                                                                    FIFOs, an empty FIFO presets the
                                                                                    counter to the value configured by
                                                                                    TOCC.TOP. Down-counting is started
                                                                                    when the first FIFO element is
                                                                                    stored.   00  Continuous operation
                                                                                    01  Timeout controlled by Tx Event
                                                                                    FIFO   10  Timeout controlled by Rx
                                                                                    FIFO 0   11  Timeout controlled by Rx
                                                                                    FIFO 1   Qualified Write is possible
                                                                                    only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
/* CANFD1_MCAN_TOCC[TOP] Bits */
#define CANFD1_MCAN_TOCC_TOP_OFS                 (16)                            /* !< TOP Offset */
#define CANFD1_MCAN_TOCC_TOP_MASK                ((uint32_t)0xFFFF0000U)         /* !< Timeout Period. Start value of the
                                                                                    Timeout Counter (down-counter).
                                                                                    Configures the Timeout Period.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */

/* CANFD1_MCAN_TOCV Bits */
/* CANFD1_MCAN_TOCV[TOC] Bits */
#define CANFD1_MCAN_TOCV_TOC_OFS                 (0)                             /* !< TOC Offset */
#define CANFD1_MCAN_TOCV_TOC_MASK                ((uint32_t)0x0000FFFFU)         /* !< Timeout Counter. The Timeout
                                                                                    Counter is decremented in multiples
                                                                                    of CAN bit times, (1...16), depending
                                                                                    on the configuration of TSCC.TCP.
                                                                                    When decremented to zero, interrupt
                                                                                    flag IR.TOO is set and the Timeout
                                                                                    Counter is stopped. Start and
                                                                                    reset/restart conditions are
                                                                                    configured via TOCC.TOS. */

/* CANFD1_MCAN_ECR Bits */
/* CANFD1_MCAN_ECR[TEC] Bits */
#define CANFD1_MCAN_ECR_TEC_OFS                  (0)                             /* !< TEC Offset */
#define CANFD1_MCAN_ECR_TEC_MASK                 ((uint32_t)0x000000FFU)         /* !< Transmit Error Counter. Actual
                                                                                    state of the Transmit Error Counter,
                                                                                    values between 0 and 255.   Note:
                                                                                    When CCCR.ASM is set, the CAN
                                                                                    protocol controller does not
                                                                                    increment TEC and REC when a CAN
                                                                                    protocol error is detected, but CEL
                                                                                    is still incremented. */
/* CANFD1_MCAN_ECR[REC] Bits */
#define CANFD1_MCAN_ECR_REC_OFS                  (8)                             /* !< REC Offset */
#define CANFD1_MCAN_ECR_REC_MASK                 ((uint32_t)0x00007F00U)         /* !< Receive Error Counter. Actual state
                                                                                    of the Receive Error Counter, values
                                                                                    between 0 and 127.   Note: When
                                                                                    CCCR.ASM is set, the CAN protocol
                                                                                    controller does not increment TEC and
                                                                                    REC when a CAN protocol error is
                                                                                    detected, but CEL is still
                                                                                    incremented. */
/* CANFD1_MCAN_ECR[RP] Bits */
#define CANFD1_MCAN_ECR_RP_OFS                   (15)                            /* !< RP Offset */
#define CANFD1_MCAN_ECR_RP_MASK                  ((uint32_t)0x00008000U)         /* !< Receive Error Passive   0  The
                                                                                    Receive Error Counter is below the
                                                                                    error passive level of 128   1  The
                                                                                    Receive Error Counter has reached the
                                                                                    error passive level of 128 */
/* CANFD1_MCAN_ECR[CEL] Bits */
#define CANFD1_MCAN_ECR_CEL_OFS                  (16)                            /* !< CEL Offset */
#define CANFD1_MCAN_ECR_CEL_MASK                 ((uint32_t)0x00FF0000U)         /* !< CAN Error Logging. The counter is
                                                                                    incremented each time when a CAN
                                                                                    protocol error causes the Transmit
                                                                                    Error Counter or the Receive Error
                                                                                    Counter to be incremented. It is
                                                                                    reset by read access to CEL. The
                                                                                    counter stops at 0xFF; the next
                                                                                    increment of TEC or REC sets
                                                                                    interrupt flag IR.ELO.   Note: When
                                                                                    CCCR.ASM is set, the CAN protocol
                                                                                    controller does not increment TEC and
                                                                                    REC when a CAN protocol error is
                                                                                    detected, but CEL is still
                                                                                    incremented. */

