TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCAN_TDCR Bits */
/* CANFD1_MCAN_TDCR[TDCF] Bits */
#define CANFD1_MCAN_TDCR_TDCF_OFS                (0)                             /* !< TDCF Offset */
#define CANFD1_MCAN_TDCR_TDCF_MASK               ((uint32_t)0x0000007FU)         /* !< Transmitter Delay Compensation
                                                                                    Filter Window Length. Defines the
                                                                                    minimum value for the SSP position,
                                                                                    dominant edges on the internal CAN RX
                                                                                    signal that would result in an
                                                                                    earlier SSP position are ignored for
                                                                                    transmitter delay measurement. The
                                                                                    feature is enabled when TDCF is
                                                                                    configured to a value greater than
                                                                                    TDCO. Valid values are 0 to 127 mtq.
                                                                                    Qualified Write is possible only
                                                                                    with CCCR.CCE='1' and CCCR.INIT='1'. */
/* CANFD1_MCAN_TDCR[TDCO] Bits */
#define CANFD1_MCAN_TDCR_TDCO_OFS                (8)                             /* !< TDCO Offset */
#define CANFD1_MCAN_TDCR_TDCO_MASK               ((uint32_t)0x00007F00U)         /* !< Transmitter Delay Compensation
                                                                                    Offset. Offset value defining the
                                                                                    distance between the measured delay
                                                                                    from the internal CAN TX signal to
                                                                                    the internal CAN RX signal and the
                                                                                    secondary sample point. Valid values
                                                                                    are 0 to 127 mtq.   Qualified Write
                                                                                    is possible only with CCCR.CCE='1'
                                                                                    and CCCR.INIT='1'. */

/* CANFD1_MCAN_IR Bits */
/* CANFD1_MCAN_IR[RF0N] Bits */
#define CANFD1_MCAN_IR_RF0N_OFS                  (0)                             /* !< RF0N Offset */
#define CANFD1_MCAN_IR_RF0N_MASK                 ((uint32_t)0x00000001U)         /* !< Rx FIFO 0 New Message   0  No new
                                                                                    message written to Rx FIFO 0   1  New
                                                                                    message written to Rx FIFO 0 */
/* CANFD1_MCAN_IR[RF0W] Bits */
#define CANFD1_MCAN_IR_RF0W_OFS                  (1)                             /* !< RF0W Offset */
#define CANFD1_MCAN_IR_RF0W_MASK                 ((uint32_t)0x00000002U)         /* !< Rx FIFO 0 Watermark Reached   0  Rx
                                                                                    FIFO 0 fill level below watermark   1
                                                                                    Rx FIFO 0 fill level reached
                                                                                    watermark */
/* CANFD1_MCAN_IR[RF0F] Bits */
#define CANFD1_MCAN_IR_RF0F_OFS                  (2)                             /* !< RF0F Offset */
#define CANFD1_MCAN_IR_RF0F_MASK                 ((uint32_t)0x00000004U)         /* !< Rx FIFO 0 Full   0  Rx FIFO 0 not
                                                                                    full   1  Rx FIFO 0 full */
/* CANFD1_MCAN_IR[RF0L] Bits */
#define CANFD1_MCAN_IR_RF0L_OFS                  (3)                             /* !< RF0L Offset */
#define CANFD1_MCAN_IR_RF0L_MASK                 ((uint32_t)0x00000008U)         /* !< Rx FIFO 0 Message Lost   0  No Rx
                                                                                    FIFO 0 message lost   1  Rx FIFO 0
                                                                                    message lost, also set after write
                                                                                    attempt to Rx FIFO 0 of size zero */
/* CANFD1_MCAN_IR[RF1N] Bits */
#define CANFD1_MCAN_IR_RF1N_OFS                  (4)                             /* !< RF1N Offset */
#define CANFD1_MCAN_IR_RF1N_MASK                 ((uint32_t)0x00000010U)         /* !< Rx FIFO 1 New Message   0  No new
                                                                                    message written to Rx FIFO 1   1  New
                                                                                    message written to Rx FIFO 1 */
/* CANFD1_MCAN_IR[RF1W] Bits */
#define CANFD1_MCAN_IR_RF1W_OFS                  (5)                             /* !< RF1W Offset */
#define CANFD1_MCAN_IR_RF1W_MASK                 ((uint32_t)0x00000020U)         /* !< Rx FIFO 1 Watermark Reached   0  Rx
                                                                                    FIFO 1 fill level below watermark   1
                                                                                    Rx FIFO 1 fill level reached
                                                                                    watermark */
/* CANFD1_MCAN_IR[RF1F] Bits */
#define CANFD1_MCAN_IR_RF1F_OFS                  (6)                             /* !< RF1F Offset */
#define CANFD1_MCAN_IR_RF1F_MASK                 ((uint32_t)0x00000040U)         /* !< Rx FIFO 1 Full   0  Rx FIFO 1 not
                                                                                    full   1  Rx FIFO 1 full */
/* CANFD1_MCAN_IR[RF1L] Bits */
#define CANFD1_MCAN_IR_RF1L_OFS                  (7)                             /* !< RF1L Offset */
#define CANFD1_MCAN_IR_RF1L_MASK                 ((uint32_t)0x00000080U)         /* !< Rx FIFO 1 Message Lost   0  No Rx
                                                                                    FIFO 1 message lost   1  Rx FIFO 1
                                                                                    message lost, also set after write
                                                                                    attempt to Rx FIFO 1 of size zero */
/* CANFD1_MCAN_IR[HPM] Bits */
#define CANFD1_MCAN_IR_HPM_OFS                   (8)                             /* !< HPM Offset */
#define CANFD1_MCAN_IR_HPM_MASK                  ((uint32_t)0x00000100U)         /* !< High Priority Message   0  No high
                                                                                    priority message received   1  High
                                                                                    priority message received */
/* CANFD1_MCAN_IR[TC] Bits */
#define CANFD1_MCAN_IR_TC_OFS                    (9)                             /* !< TC Offset */
#define CANFD1_MCAN_IR_TC_MASK                   ((uint32_t)0x00000200U)         /* !< Transmission Completed   0  No
                                                                                    transmission completed   1
                                                                                    Transmission completed */
/* CANFD1_MCAN_IR[TCF] Bits */
#define CANFD1_MCAN_IR_TCF_OFS                   (10)                            /* !< TCF Offset */
#define CANFD1_MCAN_IR_TCF_MASK                  ((uint32_t)0x00000400U)         /* !< Transmission Cancellation Finished
                                                                                    0  No transmission cancellation
                                                                                    finished   1  Transmission
                                                                                    cancellation finished */
/* CANFD1_MCAN_IR[TFE] Bits */
#define CANFD1_MCAN_IR_TFE_OFS                   (11)                            /* !< TFE Offset */
#define CANFD1_MCAN_IR_TFE_MASK                  ((uint32_t)0x00000800U)         /* !< Tx FIFO Empty   0  Tx FIFO
                                                                                    non-empty   1  Tx FIFO empty */
/* CANFD1_MCAN_IR[TEFN] Bits */
#define CANFD1_MCAN_IR_TEFN_OFS                  (12)                            /* !< TEFN Offset */
#define CANFD1_MCAN_IR_TEFN_MASK                 ((uint32_t)0x00001000U)         /* !< Tx Event FIFO New Entry   0  Tx
                                                                                    Event FIFO unchanged   1  Tx Handler
                                                                                    wrote Tx Event FIFO element */
/* CANFD1_MCAN_IR[TEFW] Bits */
#define CANFD1_MCAN_IR_TEFW_OFS                  (13)                            /* !< TEFW Offset */
#define CANFD1_MCAN_IR_TEFW_MASK                 ((uint32_t)0x00002000U)         /* !< Tx Event FIFO Watermark Reached   0
                                                                                    Tx Event FIFO fill level below
                                                                                    watermark   1  Tx Event FIFO fill
                                                                                    level reached watermark */
/* CANFD1_MCAN_IR[TEFF] Bits */
#define CANFD1_MCAN_IR_TEFF_OFS                  (14)                            /* !< TEFF Offset */
#define CANFD1_MCAN_IR_TEFF_MASK                 ((uint32_t)0x00004000U)         /* !< Tx Event FIFO Full   0  Tx Event
                                                                                    FIFO not full   1  Tx Event FIFO full */
/* CANFD1_MCAN_IR[TEFL] Bits */
#define CANFD1_MCAN_IR_TEFL_OFS                  (15)                            /* !< TEFL Offset */
#define CANFD1_MCAN_IR_TEFL_MASK                 ((uint32_t)0x00008000U)         /* !< Tx Event FIFO Element Lost   0  No
                                                                                    Tx Event FIFO element lost   1  Tx
                                                                                    Event FIFO element lost, also set
                                                                                    after write attempt to Tx Event FIFO
                                                                                    of size zero */
/* CANFD1_MCAN_IR[TSW] Bits */
#define CANFD1_MCAN_IR_TSW_OFS                   (16)                            /* !< TSW Offset */
#define CANFD1_MCAN_IR_TSW_MASK                  ((uint32_t)0x00010000U)         /* !< Timestamp Wraparound   0  No
                                                                                    timestamp counter wrap-around   1
                                                                                    Timestamp counter wrapped around */
/* CANFD1_MCAN_IR[MRAF] Bits */
#define CANFD1_MCAN_IR_MRAF_OFS                  (17)                            /* !< MRAF Offset */
#define CANFD1_MCAN_IR_MRAF_MASK                 ((uint32_t)0x00020000U)         /* !< Message RAM Access Failure.  The
                                                                                    flag is set, when the Rx Handler:   -
                                                                                    has not completed acceptance
                                                                                    filtering or storage of an accepted
                                                                                    message until the arbitration field
                                                                                    of the following message has been
                                                                                    received. In this case acceptance
                                                                                    filtering or message storage is
                                                                                    aborted and the Rx Handler starts
                                                                                    processing of the following message.
                                                                                    - was not able to write a message to
                                                                                    the Message RAM. In this case message
                                                                                    storage is aborted.   In both cases
                                                                                    the FIFO put index is not updated
                                                                                    resp. the New Data flag for a
                                                                                    dedicated Rx Buffer is not set, a
                                                                                    partly stored message is overwritten
                                                                                    when the next message is stored to
                                                                                    this location.   The flag is also set
                                                                                    when the Tx Handler was not able to
                                                                                    read a message from the Message RAM
                                                                                    in time. In this case message
                                                                                    transmission is aborted. In case of a
                                                                                    Tx Handler access failure the MCAN is
                                                                                    switched into Restricted Operation
                                                                                    Mode. To leave Restricted Operation
                                                                                    Mode, the Host CPU has to reset
                                                                                    CCCR.ASM.   0  No Message RAM access
                                                                                    failure occurred   1  Message RAM
                                                                                    access failure occurred */
/* CANFD1_MCAN_IR[TOO] Bits */
#define CANFD1_MCAN_IR_TOO_OFS                   (18)                            /* !< TOO Offset */
#define CANFD1_MCAN_IR_TOO_MASK                  ((uint32_t)0x00040000U)         /* !< Timeout Occurred   0  No timeout
                                                                                    1  Timeout reached */
/* CANFD1_MCAN_IR[DRX] Bits */
#define CANFD1_MCAN_IR_DRX_OFS                   (19)                            /* !< DRX Offset */
#define CANFD1_MCAN_IR_DRX_MASK                  ((uint32_t)0x00080000U)         /* !< Message Stored to Dedicated Rx
                                                                                    Buffer. The flag is set whenever a
                                                                                    received message has been stored into
                                                                                    a dedicated Rx Buffer.   0  No Rx
                                                                                    Buffer updated   1  At least one
                                                                                    received message stored into an Rx
                                                                                    Buffer */
/* CANFD1_MCAN_IR[BEU] Bits */
#define CANFD1_MCAN_IR_BEU_OFS                   (21)                            /* !< BEU Offset */
#define CANFD1_MCAN_IR_BEU_MASK                  ((uint32_t)0x00200000U)         /* !< Bit Error Uncorrected. Message RAM
                                                                                    bit error detected, uncorrected. This
                                                                                    bit is set when a double bit error is
                                                                                    detected by the ECC aggregator
                                                                                    attached to the Message RAM. An
                                                                                    uncorrected Message RAM bit error
                                                                                    sets CCCR.INIT to '1'. This is done
                                                                                    to avoid transmission of corrupted
                                                                                    data.   0  No bit error detected when
                                                                                    reading from Message RAM   1  Bit
                                                                                    error detected, uncorrected (e.g.
                                                                                    parity logic) */
/* CANFD1_MCAN_IR[ELO] Bits */
#define CANFD1_MCAN_IR_ELO_OFS                   (22)                            /* !< ELO Offset */
#define CANFD1_MCAN_IR_ELO_MASK                  ((uint32_t)0x00400000U)         /* !< Error Logging Overflow   0  CAN
                                                                                    Error Logging Counter did not
                                                                                    overflow   1  Overflow of CAN Error
                                                                                    Logging Counter occurred */
/* CANFD1_MCAN_IR[EP] Bits */
#define CANFD1_MCAN_IR_EP_OFS                    (23)                            /* !< EP Offset */
#define CANFD1_MCAN_IR_EP_MASK                   ((uint32_t)0x00800000U)         /* !< Error Passive   0  Error_Passive
                                                                                    status unchanged   1  Error_Passive
                                                                                    status changed */
/* CANFD1_MCAN_IR[EW] Bits */
#define CANFD1_MCAN_IR_EW_OFS                    (24)                            /* !< EW Offset */
#define CANFD1_MCAN_IR_EW_MASK                   ((uint32_t)0x01000000U)         /* !< Warning Status   0  Error_Warning
                                                                                    status unchanged   1  Error_Warning
                                                                                    status changed */
/* CANFD1_MCAN_IR[BO] Bits */
#define CANFD1_MCAN_IR_BO_OFS                    (25)                            /* !< BO Offset */
#define CANFD1_MCAN_IR_BO_MASK                   ((uint32_t)0x02000000U)         /* !< Bus_Off Status   0  Bus_Off status
                                                                                    unchanged   1  Bus_Off status changed */
/* CANFD1_MCAN_IR[WDI] Bits */
#define CANFD1_MCAN_IR_WDI_OFS                   (26)                            /* !< WDI Offset */
#define CANFD1_MCAN_IR_WDI_MASK                  ((uint32_t)0x04000000U)         /* !< Watchdog Interrupt   0  No Message
                                                                                    RAM Watchdog event occurred   1
                                                                                    Message RAM Watchdog event due to
                                                                                    missing READY */
/* CANFD1_MCAN_IR[PEA] Bits */
#define CANFD1_MCAN_IR_PEA_OFS                   (27)                            /* !< PEA Offset */
#define CANFD1_MCAN_IR_PEA_MASK                  ((uint32_t)0x08000000U)         /* !< Protocol Error in Arbitration Phase
                                                                                    (Nominal Bit Time is used)   0  No
                                                                                    protocol error in arbitration phase
                                                                                    1  Protocol error in arbitration
                                                                                    phase detected (PSR.LEC ? 0,7) */
/* CANFD1_MCAN_IR[PED] Bits */
#define CANFD1_MCAN_IR_PED_OFS                   (28)                            /* !< PED Offset */
#define CANFD1_MCAN_IR_PED_MASK                  ((uint32_t)0x10000000U)         /* !< Protocol Error in Data Phase (Data
                                                                                    Bit Time is used)   0  No protocol
                                                                                    error in data phase   1  Protocol
                                                                                    error in data phase detected
                                                                                    (PSR.DLEC ? 0,7) */
/* CANFD1_MCAN_IR[ARA] Bits */
#define CANFD1_MCAN_IR_ARA_OFS                   (29)                            /* !< ARA Offset */
#define CANFD1_MCAN_IR_ARA_MASK                  ((uint32_t)0x20000000U)         /* !< Access to Reserved Address   0  No
                                                                                    access to reserved address occurred
                                                                                    1  Access to reserved address
                                                                                    occurred */

