TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCAN_TXBTO Bits */
/* CANFD1_MCAN_TXBTO[TO0] Bits */
#define CANFD1_MCAN_TXBTO_TO0_OFS                (0)                             /* !< TO0 Offset */
#define CANFD1_MCAN_TXBTO_TO0_MASK               ((uint32_t)0x00000001U)         /* !< Transmission Occurred 0.   Each Tx
                                                                                    Buffer has its own Transmission
                                                                                    Occurred bit. The bits are set when
                                                                                    the corresponding TXBRP bit is
                                                                                    cleared after a successful
                                                                                    transmission. The bits are reset when
                                                                                    a new transmission is requested by
                                                                                    writing a '1' to the corresponding
                                                                                    bit of register TXBAR.   0  No
                                                                                    transmission occurred   1
                                                                                    Transmission occurred */
/* CANFD1_MCAN_TXBTO[TO1] Bits */
#define CANFD1_MCAN_TXBTO_TO1_OFS                (1)                             /* !< TO1 Offset */
#define CANFD1_MCAN_TXBTO_TO1_MASK               ((uint32_t)0x00000002U)         /* !< Transmission Occurred 1. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO2] Bits */
#define CANFD1_MCAN_TXBTO_TO2_OFS                (2)                             /* !< TO2 Offset */
#define CANFD1_MCAN_TXBTO_TO2_MASK               ((uint32_t)0x00000004U)         /* !< Transmission Occurred 2. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO3] Bits */
#define CANFD1_MCAN_TXBTO_TO3_OFS                (3)                             /* !< TO3 Offset */
#define CANFD1_MCAN_TXBTO_TO3_MASK               ((uint32_t)0x00000008U)         /* !< Transmission Occurred 3. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO4] Bits */
#define CANFD1_MCAN_TXBTO_TO4_OFS                (4)                             /* !< TO4 Offset */
#define CANFD1_MCAN_TXBTO_TO4_MASK               ((uint32_t)0x00000010U)         /* !< Transmission Occurred 4. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO5] Bits */
#define CANFD1_MCAN_TXBTO_TO5_OFS                (5)                             /* !< TO5 Offset */
#define CANFD1_MCAN_TXBTO_TO5_MASK               ((uint32_t)0x00000020U)         /* !< Transmission Occurred 5. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO6] Bits */
#define CANFD1_MCAN_TXBTO_TO6_OFS                (6)                             /* !< TO6 Offset */
#define CANFD1_MCAN_TXBTO_TO6_MASK               ((uint32_t)0x00000040U)         /* !< Transmission Occurred 6. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO7] Bits */
#define CANFD1_MCAN_TXBTO_TO7_OFS                (7)                             /* !< TO7 Offset */
#define CANFD1_MCAN_TXBTO_TO7_MASK               ((uint32_t)0x00000080U)         /* !< Transmission Occurred 7. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO8] Bits */
#define CANFD1_MCAN_TXBTO_TO8_OFS                (8)                             /* !< TO8 Offset */
#define CANFD1_MCAN_TXBTO_TO8_MASK               ((uint32_t)0x00000100U)         /* !< Transmission Occurred 8. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO9] Bits */
#define CANFD1_MCAN_TXBTO_TO9_OFS                (9)                             /* !< TO9 Offset */
#define CANFD1_MCAN_TXBTO_TO9_MASK               ((uint32_t)0x00000200U)         /* !< Transmission Occurred 9. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO10] Bits */
#define CANFD1_MCAN_TXBTO_TO10_OFS               (10)                            /* !< TO10 Offset */
#define CANFD1_MCAN_TXBTO_TO10_MASK              ((uint32_t)0x00000400U)         /* !< Transmission Occurred 10. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO11] Bits */
#define CANFD1_MCAN_TXBTO_TO11_OFS               (11)                            /* !< TO11 Offset */
#define CANFD1_MCAN_TXBTO_TO11_MASK              ((uint32_t)0x00000800U)         /* !< Transmission Occurred 11. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO12] Bits */
#define CANFD1_MCAN_TXBTO_TO12_OFS               (12)                            /* !< TO12 Offset */
#define CANFD1_MCAN_TXBTO_TO12_MASK              ((uint32_t)0x00001000U)         /* !< Transmission Occurred 12. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO13] Bits */
#define CANFD1_MCAN_TXBTO_TO13_OFS               (13)                            /* !< TO13 Offset */
#define CANFD1_MCAN_TXBTO_TO13_MASK              ((uint32_t)0x00002000U)         /* !< Transmission Occurred 13. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO14] Bits */
#define CANFD1_MCAN_TXBTO_TO14_OFS               (14)                            /* !< TO14 Offset */
#define CANFD1_MCAN_TXBTO_TO14_MASK              ((uint32_t)0x00004000U)         /* !< Transmission Occurred 14. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO15] Bits */
#define CANFD1_MCAN_TXBTO_TO15_OFS               (15)                            /* !< TO15 Offset */
#define CANFD1_MCAN_TXBTO_TO15_MASK              ((uint32_t)0x00008000U)         /* !< Transmission Occurred 15. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO16] Bits */
#define CANFD1_MCAN_TXBTO_TO16_OFS               (16)                            /* !< TO16 Offset */
#define CANFD1_MCAN_TXBTO_TO16_MASK              ((uint32_t)0x00010000U)         /* !< Transmission Occurred 16. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO17] Bits */
#define CANFD1_MCAN_TXBTO_TO17_OFS               (17)                            /* !< TO17 Offset */
#define CANFD1_MCAN_TXBTO_TO17_MASK              ((uint32_t)0x00020000U)         /* !< Transmission Occurred 17. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO18] Bits */
#define CANFD1_MCAN_TXBTO_TO18_OFS               (18)                            /* !< TO18 Offset */
#define CANFD1_MCAN_TXBTO_TO18_MASK              ((uint32_t)0x00040000U)         /* !< Transmission Occurred 18. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO19] Bits */
#define CANFD1_MCAN_TXBTO_TO19_OFS               (19)                            /* !< TO19 Offset */
#define CANFD1_MCAN_TXBTO_TO19_MASK              ((uint32_t)0x00080000U)         /* !< Transmission Occurred 19. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO20] Bits */
#define CANFD1_MCAN_TXBTO_TO20_OFS               (20)                            /* !< TO20 Offset */
#define CANFD1_MCAN_TXBTO_TO20_MASK              ((uint32_t)0x00100000U)         /* !< Transmission Occurred 20. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO21] Bits */
#define CANFD1_MCAN_TXBTO_TO21_OFS               (21)                            /* !< TO21 Offset */
#define CANFD1_MCAN_TXBTO_TO21_MASK              ((uint32_t)0x00200000U)         /* !< Transmission Occurred 21. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO22] Bits */
#define CANFD1_MCAN_TXBTO_TO22_OFS               (22)                            /* !< TO22 Offset */
#define CANFD1_MCAN_TXBTO_TO22_MASK              ((uint32_t)0x00400000U)         /* !< Transmission Occurred 22. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO23] Bits */
#define CANFD1_MCAN_TXBTO_TO23_OFS               (23)                            /* !< TO23 Offset */
#define CANFD1_MCAN_TXBTO_TO23_MASK              ((uint32_t)0x00800000U)         /* !< Transmission Occurred 23. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO24] Bits */
#define CANFD1_MCAN_TXBTO_TO24_OFS               (24)                            /* !< TO24 Offset */
#define CANFD1_MCAN_TXBTO_TO24_MASK              ((uint32_t)0x01000000U)         /* !< Transmission Occurred 24. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO25] Bits */
#define CANFD1_MCAN_TXBTO_TO25_OFS               (25)                            /* !< TO25 Offset */
#define CANFD1_MCAN_TXBTO_TO25_MASK              ((uint32_t)0x02000000U)         /* !< Transmission Occurred 25. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO26] Bits */
#define CANFD1_MCAN_TXBTO_TO26_OFS               (26)                            /* !< TO26 Offset */
#define CANFD1_MCAN_TXBTO_TO26_MASK              ((uint32_t)0x04000000U)         /* !< Transmission Occurred 26. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO27] Bits */
#define CANFD1_MCAN_TXBTO_TO27_OFS               (27)                            /* !< TO27 Offset */
#define CANFD1_MCAN_TXBTO_TO27_MASK              ((uint32_t)0x08000000U)         /* !< Transmission Occurred 27. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO28] Bits */
#define CANFD1_MCAN_TXBTO_TO28_OFS               (28)                            /* !< TO28 Offset */
#define CANFD1_MCAN_TXBTO_TO28_MASK              ((uint32_t)0x10000000U)         /* !< Transmission Occurred 28. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO29] Bits */
#define CANFD1_MCAN_TXBTO_TO29_OFS               (29)                            /* !< TO29 Offset */
#define CANFD1_MCAN_TXBTO_TO29_MASK              ((uint32_t)0x20000000U)         /* !< Transmission Occurred 29. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO30] Bits */
#define CANFD1_MCAN_TXBTO_TO30_OFS               (30)                            /* !< TO30 Offset */
#define CANFD1_MCAN_TXBTO_TO30_MASK              ((uint32_t)0x40000000U)         /* !< Transmission Occurred 30. See
                                                                                    description for bit 0. */
/* CANFD1_MCAN_TXBTO[TO31] Bits */
#define CANFD1_MCAN_TXBTO_TO31_OFS               (31)                            /* !< TO31 Offset */
#define CANFD1_MCAN_TXBTO_TO31_MASK              ((uint32_t)0x80000000U)         /* !< Transmission Occurred 31. See
                                                                                    description for bit 0. */

