TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_canfd1.h
/* CANFD1_MCAN_TXEFA Bits */
/* CANFD1_MCAN_TXEFA[EFAI] Bits */
#define CANFD1_MCAN_TXEFA_EFAI_OFS               (0)                             /* !< EFAI Offset */
#define CANFD1_MCAN_TXEFA_EFAI_MASK              ((uint32_t)0x0000001FU)         /* !< Event FIFO Acknowledge Index. After
                                                                                    the Host has read an element or a
                                                                                    sequence of elements from the Tx
                                                                                    Event FIFO it has to write the index
                                                                                    of the last element read from Tx
                                                                                    Event FIFO to EFAI. This will set the
                                                                                    Tx Event FIFO Get Index TXEFS.EFGI to
                                                                                    EFAI + 1 and update the Event FIFO
                                                                                    Fill Level TXEFS.EFFL. */

/* CANFD1_PWREN Bits */
/* CANFD1_PWREN[ENABLE] Bits */
#define CANFD1_PWREN_ENABLE_OFS                  (0)                             /* !< ENABLE Offset */
#define CANFD1_PWREN_ENABLE_MASK                 ((uint32_t)0x00000001U)         /* !< Enable the power */
#define CANFD1_PWREN_ENABLE_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable Power */
#define CANFD1_PWREN_ENABLE_ENABLE               ((uint32_t)0x00000001U)         /* !< Enable Power */
/* CANFD1_PWREN[KEY] Bits */
#define CANFD1_PWREN_KEY_OFS                     (24)                            /* !< KEY Offset */
#define CANFD1_PWREN_KEY_MASK                    ((uint32_t)0xFF000000U)         /* !< KEY to allow Power State Change */
#define CANFD1_PWREN_KEY_UNLOCK_W                ((uint32_t)0x26000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* CANFD1_RSTCTL Bits */
/* CANFD1_RSTCTL[RESETSTKYCLR] Bits */
#define CANFD1_RSTCTL_RESETSTKYCLR_OFS           (1)                             /* !< RESETSTKYCLR Offset */
#define CANFD1_RSTCTL_RESETSTKYCLR_MASK          ((uint32_t)0x00000002U)         /* !< Clear the RESETSTKY bit in the STAT
                                                                                    register */
#define CANFD1_RSTCTL_RESETSTKYCLR_NOP           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_RSTCTL_RESETSTKYCLR_CLR           ((uint32_t)0x00000002U)         /* !< Clear reset sticky bit */
/* CANFD1_RSTCTL[RESETASSERT] Bits */
#define CANFD1_RSTCTL_RESETASSERT_OFS            (0)                             /* !< RESETASSERT Offset */
#define CANFD1_RSTCTL_RESETASSERT_MASK           ((uint32_t)0x00000001U)         /* !< Assert reset to the peripheral */
#define CANFD1_RSTCTL_RESETASSERT_NOP            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define CANFD1_RSTCTL_RESETASSERT_ASSERT         ((uint32_t)0x00000001U)         /* !< Assert reset */
/* CANFD1_RSTCTL[KEY] Bits */
#define CANFD1_RSTCTL_KEY_OFS                    (24)                            /* !< KEY Offset */
#define CANFD1_RSTCTL_KEY_MASK                   ((uint32_t)0xFF000000U)         /* !< Unlock key */
#define CANFD1_RSTCTL_KEY_UNLOCK_W               ((uint32_t)0xB1000000U)         /* !< KEY to allow write access to this
                                                                                    register */

/* CANFD1_STAT Bits */
/* CANFD1_STAT[RESETSTKY] Bits */
#define CANFD1_STAT_RESETSTKY_OFS                (16)                            /* !< RESETSTKY Offset */
#define CANFD1_STAT_RESETSTKY_MASK               ((uint32_t)0x00010000U)         /* !< This bit indicates, if the
                                                                                    peripheral was reset, since this bit
                                                                                    was cleared by RESETSTKYCLR in the
                                                                                    RSTCTL register */
#define CANFD1_STAT_RESETSTKY_NORES              ((uint32_t)0x00000000U)         /* !< The peripheral has not been reset
                                                                                    since this bit was last cleared by
                                                                                    RESETSTKYCLR in the RSTCTL register */
#define CANFD1_STAT_RESETSTKY_RESET              ((uint32_t)0x00010000U)         /* !< The peripheral was reset since the
                                                                                    last bit clear */


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_canfd1__include */

